# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [4]:
s1 = pd.Series(np.random.randint(1, high = 5, size = 100, dtype = 'l'))
s2 = pd.Series(np.random.randint(1, high = 4, size = 100, dtype = 'l'))
s3 = pd.Series(np.random.randint(10000, high = 30001, size = 100, dtype = 'l'))

In [5]:
s1

0     1
1     4
2     4
3     1
4     3
     ..
95    1
96    1
97    1
98    4
99    2
Length: 100, dtype: int32

In [6]:
s2

0     2
1     3
2     2
3     2
4     1
     ..
95    1
96    2
97    2
98    1
99    1
Length: 100, dtype: int32

In [7]:
s3

0     20536
1     25269
2     13264
3     24959
4     29179
      ...
95    15701
96    18739
97    29268
98    14496
99    27750
Length: 100, dtype: int32

### Step 3. Let's create a DataFrame by joinning the Series by column

In [9]:
housemkt = pd.concat([s1, s2, s3], axis = 1)
housemkt.head()

   0  1      2
0  1  2  20536
1  4  3  25269
2  4  2  13264
3  1  2  24959
4  3  1  29179

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [10]:
housemkt.rename(columns = {0 : 'bedrs', 1 : 'bathrs', 2 : 'price_sqr_meter'}, inplace = True)
housemkt.head()

   bedrs  bathrs  price_sqr_meter
0      1       2            20536
1      4       3            25269
2      4       2            13264
3      1       2            24959
4      3       1            29179

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [11]:
bigcolumn = pd.concat([s1, s2, s3], axis = 0)

bigcolumn = bigcolumn.to_frame()
print(type(bigcolumn))

bigcolumn

<class 'pandas.core.frame.DataFrame'>

        0
0       1
1       4
2       4
3       1
4       3
..    ...
95  15701
96  18739
97  29268
98  14496
99  27750

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [13]:
len(bigcolumn)
#it's not true

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [14]:
bigcolumn.reset_index(drop = True, inplace = True)
bigcolumn

         0
0        1
1        4
2        4
3        1
4        3
..     ...
295  15701
296  18739
297  29268
298  14496
299  27750

[300 rows x 1 columns]